CSI API ETABS v1
cAnalyze.GetSolverOption_3 Method
 Retrieves the model solver options.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSolverOption_3(
	ref int SolverType,
	ref int SolverProcessType,
	ref int NumberParallelRuns,
	ref int ResponseFileSizeMaxMB,
	ref int NumberAnalysisThreads,
	ref string StiffCase
)
Function GetSolverOption_3 (
	ByRef SolverType As Integer,
	ByRef SolverProcessType As Integer,
	ByRef NumberParallelRuns As Integer,
	ByRef ResponseFileSizeMaxMB As Integer,
	ByRef NumberAnalysisThreads As Integer,
	ByRef StiffCase As String
) As Integer
Dim instance As cAnalyze
Dim SolverType As Integer
Dim SolverProcessType As Integer
Dim NumberParallelRuns As Integer
Dim ResponseFileSizeMaxMB As Integer
Dim NumberAnalysisThreads As Integer
Dim StiffCase As String
Dim returnValue As Integer
returnValue = instance.GetSolverOption_3(SolverType,
	SolverProcessType, NumberParallelRuns,
	ResponseFileSizeMaxMB, NumberAnalysisThreads,
	StiffCase)
int GetSolverOption_3(
	int% SolverType,
	int% SolverProcessType,
	int% NumberParallelRuns,
	int% ResponseFileSizeMaxMB,
	int% NumberAnalysisThreads,
	String^% StiffCase
)
abstract GetSolverOption_3 :
        SolverType : int byref *
        SolverProcessType : int byref *
        NumberParallelRuns : int byref *
        ResponseFileSizeMaxMB : int byref *
        NumberAnalysisThreads : int byref *
        StiffCase : string byref -> int
Parameters
SolverType
Type: System.Int32
 This is 0, 1 or 2, indicating the solver type.
0 = Standard solver
1 = Advanced solver
2 = Multi-threaded solver
SolverProcessType
Type: System.Int32
 This is 0, 1 or 2, indicating the process the analysis is run.
0 = Auto (program determined)
1 = GUI process
2 = Separate process
NumberParallelRuns
Type: System.Int32
 This is an integer not including -1 or 0.
Less than -1 = The negative of the program determined value when the assigned value is 0 = Auto parallel (use up to all physical cores - limited by license).
1 = Serial.
Greater than 1 = User defined parallel (use up to this fixed number of cores - limited by license).
ResponseFileSizeMaxMB
Type: System.Int32
 The maximum size of a response file in MB before a new response file is created. Positive if user specified, negative if program determined.
NumberAnalysisThreads
Type: System.Int32
 Number of threads that the analysis can use. Positive if user specified, negative if program determined.
StiffCase
Type: System.String
 The name of the load case used when outputting the mass and stiffness matrices to text files. If this item is blank, no matrices are output.
Return Value
Type: Int32
 Returns zero if the options are successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim SolverType As Integer
       Dim SolverProcessType As Integer
       Dim NumberParallelRuns As Integer
       Dim StiffCase As String
       Dim ResponseFileSizeMaxMB As Integer
       Dim NumberAnalysisThreads As Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get model solver options
       ret = SapModel.Analyze.GetSolverOption_3(SolverType, SolverProcessType, NumberParallelRuns, ResponseFileSizeMaxMB, NumberAnalysisThreads, StiffCase)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace